import React from "react";

const AuthTerms = () => {
  return (
    <p style={{ height: "100%", display: "block", textAlign: "left" }}>
      <span style={{ display: "block", textAlign: "center" }}>
        제 1 장 총칙
      </span>{" "}
      제 1 조 (목적)
      <br /> 이 약관은 웹 사이트 (https://school-info-ok.web.app, 이하
      스쿨인포)운영하는 웹서비스의 이용조건 및 절차에 관한 사항을 명시합니다.
      <br />
      이 약관은 스쿨인포를 이용하는 회원에게 적용되며, 이 약관에 규정한 사항을
      숙지하시기 바랍니다.
      <br />
      <br />
      제 2 조 (용어의 정의)
      <br /> 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
      <br />
      ①회원 : 기본 회원 정보를 입력하였고, 스쿨인포 웹서비스의 이용에 동의한 자
      ②아이디(ID) : 회원의 식별과 스쿨인포 이용을 위한 회원의 이메일 주소
      ③비밀번호(Password) : 스쿨인포 웹서비스 이용을 위하여 회원이 자신의
      아이디를 통한 계정 사용의 정당한 권리가 있는 자임을 확인받기 위해 입력하는
      문자 및 숫자 또는 특수문자의 조합으로 나열된 것 ④ 회원가입 : 회원이
      스쿨인포에서 제공하는 웹서비스의 이용 조건과 이용 규정에 동의하여 본
      약관에 따른 약정의 체결을 청약하고, 이에 스쿨인포가 승낙하는 행위를 의미 ⑤
      이용신청 : 회원이 회원가입을 위하여 온라인상의 스쿨인포 서비스 가입신청
      양식에 따라 이용계약을 체결하기 위해 청약하는 의사표시를 의미 ⑥ 이용승낙 :
      회원이 제6조에서 정한 방법에 따라 이용신청을 하고, 제6조 제5항, 제6항의
      유보, 거절 사유가 없을 경우에 스쿨인포가 이용계약의 체결을 승낙하는
      의사표시를 의미
      <br />
      <br />
      제 3 조 (약관의 공시 및 효력과 변경)
      <br /> ①이 약관은 서비스를 이용하는 모든 회원을 대상으로 효력이 있습니다.
      ② 이 약관은 스쿨인포 웹서비스 페이지에 게시 또는 기타의 방법으로
      공지함으로써 그 효력이 발생합니다. ③ 이 약관의 변경사항에 대한 고지는
      전항과 같은 방법으로 공지함으로써 그 효력이 발생합니다.
      <br />
      <br />
      제 4 조 (통지 방법)
      <br />
      ① 스쿨인포는 회원에게 약관의 변경, 기타 동의 또는 동의를 구하기 위하여
      필요한 경우, 회원이 서비스에서 제공하는 게시판에 게시하거나 개인정보에
      기재한 전화번호, 휴대전화 문자메세지, 전자우편, 서신우편 등 연락처를
      이용하여 회원에게 통지할 수 있습니다. ② 스쿨인포는 불특정 다수 회원에 대한
      통지가 필요한 경우에는 스쿨인포 서비스 게시판 등에 게시하는 방법으로 각
      회원에 대한 개별 통지를 갈음할 수 있습니다.
      <br />
      <br />
      제 5 조 (준거법)
      <br />
      ① 이 약관에 명시되지 않은 사항에 관하여는 전기통신기본법, 전기통신사업법,
      정보통신망 이용촉진 등에 관한 법률, 개인정보 보호법 등 기타 관계법령,
      스쿨인포 정관, 스쿨인포 서비스 세부이용지침 및 이에 따른 스쿨인포
      결의사항에 의합니다.
      <br />
      <br />
      제 2 장 서비스 이용계약
      <br />
      <br />
      제 6 조 (이용계약)
      <br />
      ① 회원은 이 약관을 읽고 이를 준수할 것을 동의합니다. 회원은 스쿨인포
      서비스 이용신청을 할 때 웹서비스에 게시된 이 약관상의 “동의함” 버튼을
      누름으로써 이를 고지 받아 인지하였음을 확인합니다. ② 회원은 전항의
      “동의함” 버튼을 누르고, 스쿨인포 웹서비스 이용을 위한 필수 회원정보를
      입력한 다음 “가입” 버튼을 누름으로써, 스쿨인포과의 웹서비스 이용신청을
      합니다. 다만, 스쿨인포가 필요하다고 인정하는 경우 회원에게 별도의 서류를
      제출하도록 할 수 있습니다. ③ 회원은 스쿨인포 웹서비스 이용계약을 체결하기
      위해서는 스쿨인포에서 요청한 필수 개인정보를 제공하여야 합니다. 스쿨인포는
      서비스를 제공하기 위하여 관련법령의 규정에 따라 회원으로부터 필요한
      개인정보를 수집합니다. ④ 이용계약은 회원 1인 당 1개의 아이디를 생성할 수
      있습니다. ⑤ 스쿨인포는 아래 각 호의 어느 하나에 해당하는 경우에는
      이용계약의 승낙을 유보할 수 있습니다. ㉠ 제공서비스 설비용량에 현실적인
      여유가 없는 경우. ㉡ 서비스를 제공하기에 기술적으로 문제가 있다고 판단되는
      경우. ㉢ 스쿨인포가 재정적, 기술적으로 필요하다고 인정하는 경우. ⑥
      스쿨인포는 아래 각호의 어느 하나에 해당하는 경우에는 이용계약 청약을
      거절할 수 있습니다. ㉠ 실명이 아니거나 타인의 명의를 사용하여 신청하였을
      경우 ㉡ 이용신청시 필수 기재 사항의 기재를 누락, 또는 거짓으로 기재하거나
      타인의 자격을 증명하는 서류 또는 허위의 서류를 첨부하여 신청하였을 경우 ㉢
      스쿨인포의 사전 동의 없이 2개 이상의 아이디를 사용하거나 동일 아이디를 2인
      이상이 사용하는 경우 ㉣ 징계회피 목적의 탈퇴 후 재가입하는 경우 ㉤ 기타
      스쿨인포가 관련법령 등을 기준으로 명백하게 사회의 질서 및 미풍양속에 반할
      우려가 있음을 인정하는 경우 ㉥ 제19조 제2항에 의하여 스쿨인포가 계약을
      해지했던 회원이 다시 가입신청을 하는 경우 ㉦ 기타 이용신청자의 귀책사유로
      이용승낙이 곤란한 경우
      <br />
      <br />
      제 3 장 회원의 의무
      <br />
      제 7 조 (아이디 등의 관리책임)
      <br />
      ① 회원은 웹서비스 이용을 위한 회원 아이디, 비밀번호 관리에 대한 책임, 본인
      아이디의 제3자에 의한 부정사용 등 회원의 고의·과실로 인해 발생하는 모든
      불이익에 대한 책임을 부담합니다. 단, 이것이 스쿨인포의 고의·과실로 인하여
      야기된 경우는 스쿨인포가 책임을 부담합니다. ② 회원은 회원 아이디, 비밀번호
      및 추가정보 등을 도난 당하거나 제3자가 사용하고 있음을 인지한 경우에는
      즉시 본인의 비밀번호를 수정하는 등의 조치를 취하여야 하며 즉시 이를
      스쿨인포에 통보하여 스쿨인포의 안내를 따라야 합니다.
      <br />
      <br />
      제 8 조 (회원정보의 제공)
      <br />
      ① 회원은 회원자격 인증에 필요한 성명, 근무학교명 등의 개인정보를
      제공하여야 합니다. 수집된 개인정보는 개인정보처리방침을 따르고 있습니다. ②
      회원은 전자우편 정보가 변경되었을 경우 이를 즉시 회원정보 관리페이지에서
      변경하여야 합니다. 회원이 회원정보를 변경하지 아니하여 발생한 손해에
      대하여 스쿨인포는 책임을 부담하지 아니합니다.
      <br />
      <br />
      제 9 조 (회원의 의무)
      <br />
      ① 회원은 아래 각 호의 어느 하나에 해당하는 행위를 하여서는 아니 됩니다. ㉠
      회원가입신청 또는 변경 시 허위내용을 등록하는 행위 ㉡ 스쿨인포의 서비스에
      게시된 정보를 권한 없이 변경하거나 서비스를 이용하여 얻은 정보를 스쿨인포
      또는 게시한 권리자의 사전 승낙 없이 영리 또는 비영리의 목적으로 복제,
      출판, 방송 등에 사용하거나 제3자에게 제공하는 행위 ㉢ 스쿨인포가 제공하는
      서비스를 이용하여 제3자에게 본인을 홍보할 기회를 제공 하거나 제3자의
      홍보를 대행하는 등의 방법으로 금전을 수수하거나 서비스를 이용할 권리를
      양도하고 이를 대가로 금전을 수수하는 행위 ㉣ 스쿨인포 기타 제3자에 대한
      허위의 사실을 게재하거나 지적재산권을 침해하는 등 스쿨인포나 제3자의
      권리를 침해하는 행위 ㉤ 다른 회원의 아이디 및 비밀번호를 도용하여 부당하게
      서비스를 이용하는 행위 ㉥ 정크메일(junk mail), 스팸메일(spam mail), 행운의
      편지(chain letters), 피라미드 조직에 가입할 것을 권유하는 게시물, 외설
      또는 폭력적인 메시지•화상•음성 등이 담긴 정보를 게시하거나 기타 공서양속에
      반하는 정보를 공개 또는 게시하는 행위 ㉦ 정보통신망법 등 관련 법령에
      의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)를 전송하거나
      게시하는 행위 ㉧ 청소년보호법에서 규정하는 청소년유해매체물을 게시하는
      행위 ㉨ 공공질서 또는 미풍양속에 위배되는 내용의 정보, 문장, 도형, 음성
      등을 유포하는 행위 ㉩ 스쿨인포의 직원이나 서비스의 관리자를 가장하거나
      사칭하여 또는 타인의 명의를 모용하여 글을 게시하는 행위 ㉪ 컴퓨터
      소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할
      목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일,
      프로그램을 포함하고 있는 자료를 게시하거나 전자우편으로 발송하는 행위 ㉫
      스토킹(stalking), 욕설, 채팅글 도배 등 다른 회원의 서비스 이용을 방해하는
      행위 ㉬ 다른 회원의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위 ㉭
      불특정 다수의 회원을 대상으로 하여 광고 또는 선전을 게시하거나 스팸메일을
      전송할 목적으로 스쿨인포에서 제공하는 서비스를 이용하여 영리활동을 하는
      행위 ⓐ 스쿨인포가 제공하는 소프트웨어 등을 개작하거나 리버스 엔지니어링,
      디컴파일, 디스어셈블 하는 행위 ⓑ 현행 법령, 스쿨인포가 제공하는 서비스에
      정한 약관 기타 서비스 이용에 관한 규정을 위반하는 행위 ② 스쿨인포는 회원이
      제1항의 행위를 하는 경우 해당 게시물 등을 삭제 또는 임시 삭제할 수 있고
      서비스의 이용을 제한하거나 일방적으로 본 계약을 해지할 수 있습니다. ③
      스쿨인포가 제공하는 서비스 중 관련 법령 등의 규정에 의하여 성인인증이
      필요한 경우 회원은 해당 서비스를 이용하기 위하여 회사가 제공하는 방법에
      따라 실명정보를 회사에 제공하여야 합니다.
      <br />
      <br />
      제 4 장 서비스의 이용
      <br />
      제 10 조 (서비스 제공)
      <br />
      ① 서비스 제공은 스쿨인포의 업무상 또는 기술상 특별한 사정이 없는 한
      연중무휴, 1일 24시간을 원칙으로 합니다. 다만, 정기점검 등 서비스 개선을
      위하여 스쿨인포가 필요하다고 인정하는 경우에는 사전에 공지한 후 서비스
      제공이 일시 중지될 수 있습니다.
      <br />
      <br />
      제 11 조 (서비스 제공의 중지 및 그 통지 등) ① 스쿨인포는 변경될 서비스의
      내용 및 제공일자를 제4조에서 정한 방법으로 회원에게 통지하고 서비스를
      변경하여 제공할 수 있습니다. ② 스쿨인포는 다음 항에 해당하는 경우 서비스의
      제공을 중지할 수 있습니다. ㉠ 서비스용 설비의 보수 등 공사로 인한 부득이한
      경우 ㉡ 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스
      이용에 지장이 있는 경우. ㉢ 서비스 제공업자와의 계약 종료 등과 같은
      스쿨인포의 제반 사정으로 서비스를 유지할 수 없는 경우 ㉣ 회원이 스쿨인포의
      활동을 방해하는 경우 ㉤ 기타 천재지변, 국가비상사태 등 불가항력적 사유가
      있는 경우 ③ 본조에 의한 서비스 중단이 필요한 경우에는 스쿨인포는 제4조에서
      정한 방법으로 회원에게 통지합니다. 다만, 스쿨인포의 고의·과실 없이 통제할
      수 없는 사유로 인한 디스크 장애, 시스템다운 등 서비스의 중단으로 사전
      통지가 불가능한 경우에는 그러하지 아니합니다.
      <br />
      <br />
      제 12 조 (개인정보의 보호)
      <br />
      ① 스쿨인포는 정보통신망법, 개인정보 보호법 등 관계 법령이 정하는 바에 따라
      회원의 개인정보를 보호하기 위해 노력합니다. ② 개인정보의 보호 및 사용에
      대해서는 관련법령 및 스쿨인포의 개인정보처리방침이 적용됩니다. 다만,
      스쿨인포가 제공하는 공식 서비스 사이트 이외의 링크된 사이트에서는
      스쿨인포의 개인정보처리방침이 적용되지 않습니다. ③ 스쿨인포는 서비스에서
      제공하는 커뮤니티를 검열할 의무를 지지 않습니다. 그러나 전기통신관련법령,
      개인정보 보호법, 형사소송법, 민사소송법 등 관계법령에 의해 국가기관 등의
      적법한 제출요구가 있는 경우에는 개인신상정보를 본인의 승낙 없이 제출할 수
      있습니다. 이 경우 스쿨인포는 관계법령이 정하는 범위 내에서 재량에 따라
      정보 또는 자료의 전부 또는 일부를 삭제, 편집하여 복제, 복사, 전송, 송부할
      권리를 보유합니다. ④ 스쿨인포는 수집된 회원의 개인정보의 취급 및 관리 등의
      업무(이하 ‘개인정보취급업무’라 한다)를 스스로 수행함을 원칙으로 합니다.
      다만, 개인정보취급업무를 수행을 위하여 필요한 경우 관련법령을 준수하는
      범위 내에서 개인정보취급업무의 일부 또는 전부를 스쿨인포가 선정한 단체
      또는 기관에 위임 또는 위탁할 수 있습니다. 이에 관한 구체적인 내용은
      개인정보 처리방침을 따릅니다.
      <br />
      <br />
      제 13 조 (게시물의 저작권)
      <br />
      ① 스쿨인포가 작성한 저작물에 대한 저작권은 스쿨인포에 귀속합니다. ② 회원이
      서비스 내에 게시한 게시물(회원 사이에 전달된 정보 포함)의 저작권은 작성한
      회원에게 속하는 것으로 간주합니다, 다만 스쿨인포는 이를 서비스 게시할 수
      있는 권리를 갖습니다. ③ 스쿨인포는 게시한 회원의 동의 없이 게시물을 다른
      목적으로 사용할 수 없습니다. ④ 회원이 스쿨인포에 게시된 정보나 자료를
      이용할 때에는 다음 각 호에 해당하는 행위를 주 의해야 합니다. ㉠ 제3자의
      저작권 대상인 외부 컨텐츠(예, 폰트, 캐릭터, 상표 등)를 무단으로 복제, 전송
      또는 게시하여 교육 자료를 제작하고 이를 스쿨인포 내에서 복제, 전송, 게시
      등 공유하는 행위. ㉡ 스쿨인포의 서비스를 이용하여 얻은 정보나 자료를
      가공하여 영리목적(예, 원격연수, 출 판 등)으로 이용하거나 또는 영리목적이
      아니더라도 교육용 컨텐츠(예, 유튜브 컨텐츠 등)로 로 제작하여 제3자에게
      제공하는 행위. ㉢ 스쿨인포 서비스를 이용하여 얻은 정보나 자료를 스쿨인포
      또는 권리자의 동의 없이 타 온라인 사이트, 블로그, SNS, 등을 통해 전송,
      배포, 공유하는 행위. ㉣ 기타 정보통신망법 및 저작권법 등 관련법에서
      규정하는 금지 행위.
      <br />
      <br />
      제 14 조 (게시물의 관리)
      <br />
      ① 회원이 게시한 게시물이 정보통신망법 및 저작권법, 개인정보 보호법, 형법
      등 관련법령에 위반되는 내용을 포함하는 경우에는 권리자 또는
      개인정보주체(이하 “권리자 등”이라 한다)는 관련법령이 정한 절차에 따라 해당
      게시물의 게시 중단 및 삭제 등을 요청할 수 있으며, 스쿨인포는 관련법령에
      따른 조치를 취하여야 합니다. ② 스쿨인포는 전항에 따른 권리자 등의 요청이
      없더라도 권리침해가 인정될 만한 사유가 있을 경우 해당 게시물에 대한 게시
      중단, 삭제 등 임시조치를 취할 수 있습니다.
      <br />
      <br />
      제 15 조 (게시물 또는 내용의 삭제)
      <br />
      ① 스쿨인포는 회원의 게시물이 제9조 제1항 각호, 제13조 제4항 각호, 제14조,
      제16조 각호 중 어느 하나에 해당하는 경우, 해당 게시물 또는 그 내용을 사전
      통지나 동의 없이 이를 삭제할 수 있습니다. ② 스쿨인포는 회원이 탈퇴하거나
      적법한 사유로 제명된 경우 해당 회원이 게시한 게시물을 삭제할 수 있습니다.
      <br />
      <br />
      제 16 조 (회원 정보의 삭제 등)
      <br />
      ① 스쿨인포는 다음 각 호의 어느 하나에 해당 경우 이용 중인 회원에게
      고지하지 않고 회원 정보를 수정 또는 삭제 등의 조치를 취할 수 있습니다. ㉠
      실명이 아니거나 다른 사람의 명의를 사용하여 신청하였을 경우. ㉡ 이용신청
      시 필수 사항의 기재를 누락하거나 허위로 기재하여 신청하였을 경우. ㉢
      부당하게 2개 이상의 아이디를 사용하거나 하나의 아이디를 2인 이상이
      사용하는 경우. ㉣ 이용 중지, 해지 등 제재 회피 목적으로 탈퇴 후 재가입하는
      경우. ㉤ 사회의 질서 및 미풍양속을 저해할 목적으로 서비스를 이용하는 경우.
      ㉥ 기타 이용신청자의 귀책사유로 스쿨인포 서비스 이용의 제한이 필요한 경우.
      <br />
      <br />
      제 17 조 (양도금지)
      <br />
      ① 회원의 서비스 받을 권리는 이를 양도 내지 증여하거나 질권의 목적으로
      사용할 수 없습니다.
      <br />
      <br />
      제 18 조 (서비스 이용 제한)
      <br />
      ① 다음 각 호에 해당하는 경우 회원의 서비스 사용을 제한할 수 있으며, 기타
      이에 준하는 경우에도 회원의 서비스 사용을 제한할 수 있습니다. ㉠ 다른
      회원의 아이디를 부정 사용하는 행위 ㉡ 다른 회원의 이용을 방해하는 행위 ㉢
      스쿨인포에 게시된 정보 및 자료를 외부로 유출하는 행위 ㉣ 개인 또는 단체의
      명예를 훼손하거나 모욕하는 행위 ㉤ 개인 또는 단체의 이익을 목적으로
      부정하게 활동하는 경우 ㉥ 법률에 반하거나 기타 선량한 풍속 기타 사회질서를
      해하는 행위 ㉦ 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위 또는
      이를 우려할 만한 행위가 있는 경우 ㉧ 해킹행위 또는 컴퓨터 바이러스의
      유포행위 ㉨ 서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있는 일체의
      행위 ㉩ 운영진을 사칭 행위 ㉪ 기타 관계법령 및 스쿨인포의 운영 목적에
      위배되는 행위
      <br />
      <br />
      제 5 장 서비스 이용종료
      <br />
      제 19 조 (이용계약의 해지)
      <br />
      ① 회원이 서비스 이용계약을 해지하고자 하는 때에는 언제든지
      회원정보관리에서 스쿨인포가 정한 절차에 따라 회원의 아이디를 삭제하고
      탈퇴할 수 있습니다. ② 회원이 제9조 제1항 각호, 제13조 제4항 각호, 제14조,
      제16조부터 제18조의 규정을 위반한 경우 스쿨인포는 일방적으로 본 계약을
      해지할 수 있으며, 이로 인하여 서비스 운영에 손해가 발생한 경우 이에 대한
      민·형사상 책임을 물을 수 있습니다. ③ 회원이 서비스를 이용하는 도중,
      연속하여 일(1)년 동안 서비스를 이용하기 위해 스쿨인포의 서비스에 log-in한
      기록이 없는 경우 스쿨인포 회원의 회원자격을 상실시킬 수 있습니다.
      <br />
      <br />
      제 6 장 손해배상 및 면책
      <br />
      제 20 조 (손해 배상)
      <br />
      ① 스쿨인포는 서비스 이용과 관련하여 회원에게 손해가 발생하는 경우, 그
      손해가 스쿨인포의 중대한 과실에 의한 경우를 제외하고는 발생한 손해에
      대하여 책임을 지지 않습니다. ② 회원이 이 약관의 어느 규정 또는 법령을
      위반하여 스쿨인포가 다른 회원 또는 제3자에 대하여 책임을 부담하게 되는
      경우, 위 회원은 위 책임으로부터 스쿨인포를 면책시켜야 하며, 위 책임의
      부담으로 인하여 스쿨인포가 입게 될 손해 또는 그 상당액을 스쿨인포에 배상할
      책임이 있습니다.
      <br />
      <br />
      제 21 조 (면책)
      <br />
      ① 스쿨인포는 스쿨인포의 과실 없이 다음 각 호의 경우로 서비스를 제공할 수
      없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지
      않습니다. ㉠ 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우 ㉡
      서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인
      서비스 방해가 있는 경우 ㉢ 회원의 귀책사유로 서비스 이용에 장애가 있는
      경우 ㉣ 제1호 내지 제3호를 제외한 기타 스쿨인포의 고의·과실이 없는 사유로
      인한 경우 ② 스쿨인포는 회원이 작성하는 등의 방법으로 서비스에 게재된 정보,
      자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며, 스쿨인포의
      과실 없이 발생된 회원의 손해에 대하여는 책임을 부담하지 아니합니다.
      <br />
      <br />
      제 7 장 관할
      <br />
      제 22 조 (관할법원)
      <br />
      ① 서비스 이용과 관련하여 스쿨인포과 회원 사이에 분쟁이 발생하는 경우,
      스쿨인포과 회원은 분쟁의 원만한 해결을 위해 성실히 협의합니다. ② 전항의
      협의에 의하더라도 분쟁이 해결되지 않을 경우, 양 당사자는 민사소송법상의
      관할규정에 따라 관할권이 있는 법원에 소를 제기할 수 있습니다. 부 칙 이
      약관은 이를 공시한 날로부터 즉시 적용하여 그 효력이 발생합니다.
      <br />
      <br />
      ========================
      <br />
      <br />
      스쿨인포 웹사이트(이하 '스쿨인포')는 개인정보보호법에 따라 이용자의
      개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을
      원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
      <br />
      <br />
      1. 수집하는 개인정보의 항목 및 수집방법
      <br />
      가. 수집하는 개인정보의 항목 스쿨인포는 회원가입 등 서비스 제공을 위한
      개인정보를 아래와 같이 수집하고 있습니다. 첫째, 스쿨인포는 회원가입, 각종
      서비스의 제공을 위해 최초 회원가입 당시 아래와 같은 최소한의 개인정보를
      필수항목으로 수집하고 있습니다. =회원 가입= 필수항목 : 아이디, 비밀번호,
      이름, 닉네임, 이메일, 본인인증 CI/DI 선택항목 : 프로필 이미지 (선택항목은
      입력하지 않아도 회원가입이 가능합니다.) 둘째, 서비스 이용과정에서 아래와
      같은 정보들이 자동으로 생성되어 수집될 수 있습니다. IP 주소, 쿠키, 서비스
      이용 기록, 접속 로그 셋째, 스쿨인포 이용을 위한 회원자격 인증시 아래와
      같은 개인정보를 필수항목으로 수집하고 있습니다. =회원자격 인증= 필수항목 :
      이름, 학교(기관)명, 교원구분, 재직상태, 교육경력
      <br />
      나. 개인정보 수집방법 스쿨인포는 다음과 같은 방법으로 개인정보를
      수집합니다. 홈페이지 생성정보 수집 툴을 통한 수집
      <br />
      <br />
      2. 개인정보의 수집 및 이용 목적 스쿨인포는 수집한 개인정보를 다음의 목적을
      위해 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지
      않으며 이용 목적이 변경될 시에는 별도의 동의를 받는 등 필요한 조치를
      이행할 예정입니다.
      <br />
      가. 홈페이지 회원가입 및 관리 회원 가입의사 확인, 회원제 서비스 제공에
      따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종
      고지·통지, 고충처리 등을 목적으로 개인정보를 처리합니다.
      <br />
      나. 민원사무 처리 민원인의 신원 확인, 민원사항 확인, 사실조사를 위한
      연락·통지, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.
      <br />
      <br />
      3. 개인정보의 제3자 제공에 관한 사항 스쿨인포는 원칙적으로 이용자의
      개인정보를 수집·이용 목적으로 명시한 범위 내에서 처리하며, 다음의 경우를
      제외하고는 정보주체의 사전 동의 없이 본래의 목적 범위를 초과하여
      처리하거나 제3자에게 제공하지 않습니다. 정보주체로부터 별도의 동의를 받는
      경우 법률에 특별한 규정이 있는 경우 정보주체 또는 법정대리인이 의사표시를
      할 수 없는 상태에 있거나 주소불명 등으로 사전 동의를 받을 수 없는 경우로서
      명백히 정보주체 또는 제3자의 급박한 생명, 신체, 재산의 이익을 위하여
      필요하다고 인정되는 경우 통계작성 및 학술연구 등의 목적을 위하여 필요한
      경우로서 특정 개인을 알아 볼 수 없는 형태로 개인정보를 제공하는 경우
      개인정보를 목적 외의 용도로 이용하거나 이를 제3자에게 제공하지 아니하면
      다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우로서 보호위원회의
      심의·의결을 거친 경우 조약, 그 밖의 국제협정의 이행을 위하여 외국정보 또는
      국제기구에 제공하기 위하여 필요한 경우 범죄의 수사와 공소의 제기 및 유지를
      위하여 필요한 경우 법원의 재판업무 수행을 위하여 필요한 경우 형 및 감호,
      보호처분의 집행을 위하여 필요한 경우
      <br />
      <br />
      4. 개인정보 처리의 위탁 스쿨인포는 보다 전문적인 서비스를 제공하기 위해
      개인정보보호법 제 26조(업무위탁에 따른 개인정보의 처리 제한)에 의해
      회원정보를 위탁할 수 있으며 위탁계약 체결 시 개인정보보호의 안전을 기하기
      위하여 위탁계약 내용에 개인정보보호 관련 지시 엄수, 개인정보의 유출금지 및
      사고시의 책임부담 등을 명확히 규정하고 있습니다.
      <br />
      <br />
      5. 개인정보의 처리 및 보유 기간 스쿨인포는 법령에 따른 개인정보
      보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보
      보유, 이용기간 내에서 개인정보를 처리,보유합니다. =홈페이지 회원가입 및
      관리= '홈페이지 회원가입 및 관리'와 관련한 개인정보는 수집.이용에 관한
      동의일로부터 '회원탈퇴시'까지 위 이용목적을 위하여 보유 및 이용됩니다.
      보유근거 : 정보주체 동의 =회원자격 인증정보= 보존 항목 : 성명, 본인인증
      CI/DI, 학교(기관)명, 교원구분, 재직상태, 교육경력 보존 이유 : 회원자격
      확인 및 부정 가입 방지 보존 기간 : 회원탈퇴시까지
      <br />
      <br />
      6. 개인정보 파기 절차 및 방법 스쿨인포는 원칙적으로 개인정보 처리목적이
      달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및
      방법은 다음과 같습니다.
      <br />
      가. 파기절차 이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의
      경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후
      혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가
      아니고서는 다른 목적으로 이용되지 않습니다.
      <br />
      나. 파기기한 이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는
      보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당
      서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는
      개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그
      개인정보를 파기합니다.
      <br />
      다. 파기방법 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을
      사용합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여
      파기합니다.
      <br />
      <br />
      7. 개인정보의 안전성 확보 조치 스쿨인포는 개인정보보호법 제29조에 따라
      다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고
      있습니다.
      <br />
      가. 개인정보 취급 담당자의 최소화 및 교육 개인정보를 취급하는 담당자를
      지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고
      있습니다.
      <br />
      나. 개인정보의 암호화 이용자의 개인정보는 비밀번호는 암호화 되어 저장 및
      관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를
      암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고
      있습니다.
      <br />
      다. 개인정보에 대한 접근 제한 개인정보를 처리하는 데이터베이스시스템에
      대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여
      필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단
      접근을 통제하고 있습니다.
      <br />
      <br />
      8. 개인정보관리책임자 및 담당자
      <br />
      개인정보 관리책임자 이름 : 김거송 직위 : 대표운영자 메일 :
      kerbong@gmail.com 기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는
      아래 기관에 문의하시기 바랍니다.
      <br />
      개인정보침해신고센터 (http://privacy.kisa.or.kr / 국번없이 118) 대검찰청
      사이버범죄수사단 (http://www.spo.go.kr / 02-3480-3571) 경찰청 사이버안전국
      (http://www.ctrc.go.kr / 국번없이 182)
      <br />
      <br />
      9. 개인정보 처리방침의 변경 본 개인정보처리방침은 시행일로부터 적용되며,
      법령 및 방침에 따른 변경 내용의 추가, 삭제 및 정정이 있는 경우에는
      변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다. 공고일자 :
      2023년 10월 22일 시행일자 : 2023년 10월 29일
    </p>
  );
};

export default AuthTerms;
